# YOLOv5 Pruned Model Configuration

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple (no scaling in pruned model)
width_multiple: 1.0  # layer channel multiple (no scaling in pruned model)
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 pruned backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2]],  # 0-P1/2
   [-1, 1, Conv, [32, 3, 2]],  # 1-P2/4
   [-1, 1, C3Pruned, [32, 16, 16, 32, [[16, 16, 16]], 1, 128]],  # 2
   [-1, 1, Conv, [64, 3, 2]],  # 3-P3/8
   [-1, 2, C3Pruned, [64, 32, 31, 63, [[32, 32, 32], [32, 32, 32]], 2, 256]],  # 4
   [-1, 1, Conv, [106, 3, 2]],  # 5-P4/16
   [-1, 3, C3Pruned, [106, 43, 8, 100, [[43, 64, 64], [64, 64, 64], [64, 64, 64]], 3, 512]],  # 6
   [-1, 1, Conv, [64, 3, 2]],  # 7-P5/32
   [-1, 1, C3Pruned, [64, 30, 9, 117, [[30, 128, 125]], 1, 1024]],  # 8
   [-1, 1, SPPFPruned, [117, 111, 82, 5]],  # 9
  ]

# YOLOv5 pruned head
head:
  [[-1, 1, Conv, [83, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, C3Pruned, [183, 37, 51, 89, [[37, 42, 42]], 1, False]],  # 13

   [-1, 1, Conv, [61, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, C3Pruned, [124, 31, 28, 60, [[31, 31, 29]], 1, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [5, 3, 2]],  # 18
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, C3Pruned, [66, 30, 42, 105, [[30, 28, 46]], 1, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [28, 3, 2]],  # 21
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, C3Pruned, [111, 32, 34, 121, [[32, 37, 51]], 1, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors, [60, 105, 121]]],  # Detect(P3, P4, P5)
  ]
