# YOLOv5 Pruned Model Configuration

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0
   [-1, 1, Conv, [32, 3, 2]],  # 1
   [-1, 1, C3Pruned, [32, 16, 16, 32, [[16, 16, 16]], 1, 128]],  # 2
   [-1, 1, Conv, [64, 3, 2]],  # 3
   [-1, 2, C3Pruned, [64, 32, 28, 62, [[32, 32, 32], [32, 32, 32]], 2, 256]],  # 4
   [-1, 1, Conv, [62, 119, 3, 2]],  # 5
   [-1, 3, C3Pruned, [119, 64, 40, 123, [[64, 64, 64], [64, 64, 64], [64, 64, 64]], 3, 512]],  # 6
   [-1, 1, Conv, [123, 177, 3, 2]],  # 7
   [-1, 1, C3Pruned, [177, 128, 17, 240, [[128, 128, 128]], 1, 1024]],  # 8
   [-1, 1, SPPFPruned, [240, 126, 169, 5]],  # 9
  ]

# Head
head:
  [[-1, 1, Conv, [169, 108, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # 12
   [-1, 1, C3Pruned, [231, 52, 59, 110, [[52, 52, 44]], 1, False]],  # 13
   [-1, 1, Conv, [110, 63, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # 16
   [-1, 1, C3Pruned, [125, 31, 32, 63, [[31, 31, 32]], 1, False]],  # 17
   [-1, 1, Conv, [63, 4, 3, 2]],  # 18
   [[-1, 14], 1, Concat, [1]],  # 19
   [-1, 1, C3Pruned, [67, 33, 44, 114, [[33, 37, 58]], 1, False]],  # 20
   [-1, 1, Conv, [114, 27, 3, 2]],  # 21
   [[-1, 10], 1, Concat, [1]],  # 22
   [-1, 1, C3Pruned, [135, 39, 63, 139, [[39, 43, 60]], 1, False]],  # 23
   [[17, 20, 23], 1, Detect, [nc, anchors, [63, 114, 139]]],  # 24
  ]
